[
    {
        "nombre": "M&M Cakes",
        "img":"https://imgs.search.brave.com/yg2Fn2FbZsYOCDj4iIRUs8vMmp9tq0X5_uk4-ECwlFo/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9odW1h/bmlkYWRlcy5jb20v/d3AtY29udGVudC91/cGxvYWRzLzIwMTcv/MDIvcGF0by00LWUx/NTYwOTE4Mjg2MzE1/LmpwZw",
        "id": 1,
        "info": "Este sitio web fue el proyecto final del curso de Diseño Web que realicé al principio de mis estudios. Consistía en un sitio estático para un emprendimiento real de pastelería.",
        "info2": "A lo largo del curso realicé varios prototipos del sitio hasta llegar a este resultado final, el cual subí a GitHub Pages. En el proceso, incluí en mi sitio HTML, CSS, Bootstrap, SASS, GRIDS, SEO y animaciones. Además, para realizar el wireframe de la misma, utilicé Balsamiq.",
        "invitacion": "Los invito a hacer click en la imágen para ir hacia el sitio.",
        "tec":[
            "HTML",
            "CSS",
            "SASS",
            "Bootstrap",
            "SEO",
            "GRIDS",
            "Balsamiq",
            "Animaciones"  
        ],
        "subtitulo": "Tecnologías, conceptos y librerías utilizadas:"
    },

    {
        "nombre": "Nambooks",
        "img":"nambooksPortfolio.jpg",
        "img2":"nambooksCarrito.png",
        "id": 2,
        "info":"Nambooks fue el proyecto final que tuve que realizar a fin de obtener mi certificación en el curso de JavaScript de Coderhouse. El mismo consiste en un e-commerce ficticio de venta de libros con un carrito de compras funcional.",
        "info2":"Entre las funciones existentes en este sitio web se encuentra la posibilidad de agregar libros al carrito de compras, eliminarlos por unidad o en su totalidad, y vaciar el carrito. Al mismo tiempo, el carrito permite ver el total de compra a medida que el mismo es modificado y cuenta con la capacidad de reconocer objetos olvidados en el mismo de compras no finalizadas. Además, cuenta con una página en donde se puede confirmar el pedido de libros realizado con un formulario funcional o cancelar la orden por completo.",
        "info3":"Este proyecto formó parte del Top 10 de mi comisión y es el proyecto al que más cariño le tengo por todo lo que aprendí al realizarlo.",
        "invitacion": "Los invito a hacer click en las imágenes para ir hacia el sitio.",
        "tec":[
            "JavaScript",
            "JSON",
            "Asincronía",
            "HTML",
            "CSS",
            "Bootstrap",
            "Storage",
            "SweetAlert",
            "Toastify",
            "Operadores avanzados",
            "Objetos",
            "Funciones de orden superior"  
        ],
        "subtitulo": "Tecnologías, conceptos y librerías utilizadas:"
    },

    {
        "nombre": "Sook",
        "img": "sookPortfolio.jpg",
        "img2":"sookDetalle.png",
        "id": 3,
        "tec":[
            "ReactJs",
            "Firebase",
            "Context",
            "Async",
            "Hooks",
            "Routing y navegación",
            "Eventos",
            "Bootstrap",
            "CSS",
            "HTML"  
        ],
        "invitacion": "Los invito a hacer click en las imágenes para ir hacia el sitio.",
        "subtitulo": "Tecnologías, conceptos y librerías utilizadas:",
        "info":"Sook nació como el proyecto de mi curso de ReactJs, y tuve la alegría de verlo formar parte del Top 10 de toda mi comisión. El mismo consiste en un e-commerce, ficticio pero funcional, para una marca de venta de ropa.",
        "info2":"Este sitio web cuenta con distintas funciones, entre las que se destacan las clásicas de todo e-commerce: agregar y eliminar de un carrito, vaciarlo por completo, ver el total de la compra y realizar un check-out. Sin embargo, cuenta con unos agregados muy interesantes: como la opción de clickear un producto y ver toda la información disponible del mismo sin recargar la página o ir a otro lado (una de las magias de ReactJs) y la vinculación del sitio con una base de datos disponible en Firebase. En dicha base de datos se encuentran todos los productos y su información en tiempo real, al mismo tiempo que se almacenan los pedidos realizados junto a la información que el mismo cliente ingresa por su cuenta.",
        "info3":"Realizar este sitio fue todo un desafío, pero me permitió aprender mucho y sigo trabajando en este proyecto para poder ponerle más de mi impronta."
    }
]